ТабТовары = Источник.Материалы.Выгрузить();
Для каждого СтрокаТовары Из ТабТовары Цикл
	СтрокаТовары.Количество = СтрокаТовары.Количество * СтрокаТовары.ЕдиницаИзмерения.Коэффициент;
КонецЦикла;

Запросы.СписанныеПартии.УстановитьПараметр("ДокументСсылка", Источник.Ссылка);
Запросы.СписанныеПартии.УстановитьПараметр("Расход", ВидДвиженияНакопления.Расход);
РезультатЗапроса = Запросы.СписанныеПартии.Выполнить();

ТабПартии = РезультатЗапроса.Выгрузить();

КоллекцияОбъектов = ТабТовары.Скопировать();
КоллекцияОбъектов.Очистить();
КоллекцияОбъектов.Колонки.Добавить("Комиссия");
//Если УзелДляОбмена.ВариантПереносаСебестоимостиСписанияВБухгалтериюПредприятия <> Перечисления.ВариантыПереносаСебестоимостиСписанияВБухгалтериюПредприятия.НеПереносить Тогда
//	КоллекцияОбъектов.Колонки.Добавить("ДокументОприходования");
//	Если УзелДляОбмена.ВариантПереносаСебестоимостиСписанияВБухгалтериюПредприятия = Перечисления.ВариантыПереносаСебестоимостиСписанияВБухгалтериюПредприятия.ПереноситьДокументПартииИСебестоимость Тогда
//		КоллекцияОбъектов.Колонки.Добавить("Себестоимость");
//	КонецЕсли;
//КонецЕсли;

Для каждого СтрокаТЧ ИЗ ТабТовары Цикл
	
	СтруктураПоиска = Новый Структура;
	СтруктураПоиска.Вставить("Номенклатура", СтрокаТЧ.Номенклатура);
	СтруктураПоиска.Вставить("ХарактеристикаНоменклатуры", СтрокаТЧ.ХарактеристикаНоменклатуры);
	Если СтрокаТЧ.Номенклатура.ВестиПартионныйУчетПоСериям Тогда
		СтруктураПоиска.Вставить("СерияНоменклатуры", СтрокаТЧ.СерияНоменклатуры);
	КонецЕсли;
	
	НайденныеСтроки = ТабПартии.НайтиСтроки(СтруктураПоиска);
	
	ОстКоличество = СтрокаТЧ.Количество;
	Для каждого СтрокаПартии ИЗ НайденныеСтроки Цикл
		Если ОстКоличество > 0 И СтрокаПартии.Количество > 0 Тогда
			НоваяСтрока = КоллекцияОбъектов.Добавить();
			Для каждого Колонка ИЗ ТабТовары.Колонки Цикл
				НоваяСтрока[Колонка.Имя] = СтрокаТЧ[Колонка.Имя];
			КонецЦикла;
			НоваяСтрока.Количество = Мин(СтрокаПартии.Количество, ОстКоличество);
			НоваяСтрока.Комиссия   = (СтрокаПартии.СтатусПартии = Перечисления.СтатусыПартийТоваров.НаКомиссию);
			
			//Если УзелДляОбмена.ВариантПереносаСебестоимостиСписанияВБухгалтериюПредприятия <> Перечисления.ВариантыПереносаСебестоимостиСписанияВБухгалтериюПредприятия.НеПереносить Тогда
			//	НоваяСтрока.ДокументОприходования = СтрокаПартии.ДокументОприходования;
			//	Если УзелДляОбмена.ВариантПереносаСебестоимостиСписанияВБухгалтериюПредприятия = Перечисления.ВариантыПереносаСебестоимостиСписанияВБухгалтериюПредприятия.ПереноситьДокументПартииИСебестоимость Тогда
			//		НоваяСтрока.Себестоимость = СтрокаПартии.Стоимость;
			//	КонецЕсли;
			//КонецЕсли;
			
			// Уменьшим количество в таблице партий, чтобы не использовать одну и ту же партию несколько раз
			СтрокаПартии.Количество = СтрокаПартии.Количество - НоваяСтрока.Количество;
			
			ОстКоличество = ОстКоличество - НоваяСтрока.Количество;
			
		КонецЕсли;
	КонецЦикла;
	
	// Если пратий нет все равно выгружаем остаток товаров как собственные
	Если ОстКоличество > 0 Тогда
		НоваяСтрока = КоллекцияОбъектов.Добавить();
		Для каждого Колонка ИЗ ТабТовары.Колонки Цикл
			НоваяСтрока[Колонка.Имя] = СтрокаТЧ[Колонка.Имя];
		КонецЦикла;
		НоваяСтрока.Количество = ОстКоличество;
		НоваяСтрока.Комиссия   = Ложь;
	КонецЕсли;
	
КонецЦикла;