
СчетаУчета = БухгалтерскийУчетПереопределяемый.ПолучитьСчетаРасчетовСКонтрагентом(
	Объект.Организация,
	Объект.Контрагент,
	Объект.ДоговорКонтрагента
);
Объект.СчетУчетаРасчетовСКонтрагентом = СчетаУчета.СчетРасчетов;
Объект.СчетУчетаРасчетовПоАвансам     = СчетаУчета.СчетАвансов;

//Если Объект.ЭтоНовый() Тогда
//	Параметры.ДокументыСОпределениемДопРеквизитов.Добавить(Объект.ПолучитьСсылкуНового());
//Иначе
//	Параметры.ДокументыСОпределениемДопРеквизитов.Добавить(Объект.Ссылка);
//КонецЕсли;
Документы.ПоступлениеДопРасходов.ЗаполнитьСчетаУчетаВТабличнойЧасти(Объект, "Товары");
Для каждого СтрокаТЧ Из Объект.Товары Цикл
	СтрокаТЧ.ОтражениеВУСН = Перечисления.ОтражениеВУСН.Принимаются;
КонецЦикла;

//Если НЕ Объект.УчитыватьНДС Тогда
//	Объект.УчитыватьНДС = Истина;
//	Объект.СтавкаНДС = Перечисления.СтавкиНДС.БезНДС;
//КонецЕсли;

Выполнить(Алгоритмы.ПровестиДокумент);