Если НЕ ЗначениеЗаполнено(Объект.Организация) Тогда
	Объект.Организация = Параметры.ОсновнаяОрганизация;
КонецЕсли;

Объект.СчетаУчетаЗатратВТаблице  = Истина;  
ЕстьПрименениеУСН = УчетнаяПолитика.ПрименяетсяУСН(Объект.Организация, Объект.Дата);

// 1СTeam Томилин А.П. 05.10.2023 [T1C-3133] НАЧАЛО
ТаблицаДляСчетов = Объект.Материалы.Выгрузить();
ТаблицаДляСчетов.Колонки.Добавить("СтатьяЗатрат"); 
ТаблицаДляСчетов.Колонки.Добавить("НоменклатурнаяГруппа");

ПараметрыТЧматериалы = ПараметрыОбъекта["МатериалыТабличнаяЧасть"];
// 1СTeam Томилин А.П. 05.10.2023 [T1C-3133] КОНЕЦ

Документы.ТребованиеНакладная.ЗаполнитьСчетаУчетаВТабличнойЧасти(Объект, "Материалы");

// 1СTeam Томилин А.П. 05.10.2023 [T1C-3133] НАЧАЛО
Для Каждого СтрСчет Из ТаблицаДляСчетов Цикл
	
	СтрСчет.СтатьяЗатрат = ПараметрыТЧматериалы[СтрСчет.НомерСтроки-1].СтатьяЗатрат;
	СтрСчет.НоменклатурнаяГруппа = ПараметрыТЧматериалы[СтрСчет.НомерСтроки-1].НоменклатурнаяГруппа;
	Если Не ЗначениеЗаполнено(СтрСчет.НоменклатурнаяГруппа) Тогда
		СтрСчет.НоменклатурнаяГруппа = СтрСчет.Номенклатура.НоменклатурнаяГруппа;
	КонецЕсли;
	НоменклатурнаяГруппаПодмены = ПараметрыТЧматериалы[СтрСчет.НомерСтроки-1].НоменклатурнаяГруппаПодмены;
	Если ЗначениеЗаполнено(НоменклатурнаяГруппаПодмены) Тогда
		СтрСчет.НоменклатурнаяГруппа = НоменклатурнаяГруппаПодмены;
	КонецЕсли;
	
    НайденаяСтрока = Объект.Материалы.Найти(СтрСчет.НомерСтроки,"НомерСтроки");
    Если НайденаяСтрока <> Неопределено Тогда
        НайденаяСтрока.СчетЗатрат     = СтрСчет.СчетЗатрат;
		
		ЧислоАктивныхСубконто = НайденаяСтрока.СчетЗатрат.ВидыСубконто.Количество();
		Для Сч = 1 По ЧислоАктивныхСубконто Цикл
			
			Если НайденаяСтрока.СчетЗатрат.ВидыСубконто[Сч-1].ВидСубконто = ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.СтатьиЗатрат Тогда
				НайденаяСтрока["Субконто" + Сч] = СтрСчет.СтатьяЗатрат;
			ИначеЕсли НайденаяСтрока.СчетЗатрат.ВидыСубконто[Сч-1].ВидСубконто = ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.НоменклатурныеГруппы Тогда
				НайденаяСтрока["Субконто" + Сч] = СтрСчет.НоменклатурнаяГруппа;
			ИначеЕсли НайденаяСтрока.СчетЗатрат.ВидыСубконто[Сч-1].ВидСубконто = ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.ОбособленныеПодразделения Тогда
				НайденаяСтрока["Субконто" + Сч] = Объект.ПодразделениеОрганизации;
			ИначеЕсли НайденаяСтрока.СчетЗатрат.ВидыСубконто[Сч-1].ВидСубконто = ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.Номенклатура Тогда
				НайденаяСтрока["Субконто" + Сч] = ПараметрыОбъекта["НоменклатураГотовойПродукции"];
			КонецЕсли;
			
		КонецЦикла;	
    КонецЕсли;
КонецЦикла;
// 1СTeam Томилин А.П. 05.10.2023 [T1C-3133] КОНЕЦ

Для каждого СтрокаТабличнойЧасти Из Объект.Материалы Цикл
	// 1СTeam Томилин А.П. 05.10.2023 [T1C-3133] НАЧАЛО
	// БЫЛО перенесено в https://crystals.atlassian.net/browse/T1C-3133?focusedCommentId=236488
	// 1СTeam Томилин А.П. 05.10.2023 [T1C-3133] КОНЕЦ
	Если ЕстьПрименениеУСН тогда
		СтрокаТабличнойЧасти.ОтражениеВУСН = Перечисления.ОтражениеВУСН.Принимаются;
	КонецЕсли;	
	
	Если СтрокаТабличнойЧасти.СчетЗатрат.УчетПоПодразделениям Тогда
		СтрокаТабличнойЧасти.ПодразделениеЗатрат = Объект.ПодразделениеЗатрат;
	КонецЕсли;	
КонецЦикла;

Если НЕ ЗначениеЗаполнено(Объект.Склад) Тогда
	Объект.Склад = Параметры.СкладДляОбменаДаннымиСУТ;
КонецЕсли;

// -- обработка счета затрат по БУ и НУ (если указан один и тот же счет затрат) --
Таблица = ТаблицаДляСчетов.Скопировать(); // Было Объект.Материалы.Выгрузить(); // 1СTeam Томилин А.П. 05.10.2023 [T1C-3133]
Таблица.Свернуть("СчетЗатрат, СтатьяЗатрат", "");

Если Таблица.Количество() = 1 Тогда
	
	Объект.СчетаУчетаЗатратВТаблице = Ложь; 	
	Объект.СчетЗатрат = ТаблицаДляСчетов[0].СчетЗатрат; //Было Объект.Материалы[0] // 1СTeam Томилин А.П. 05.10.2023 [T1C-3133]
	ЧислоАктивныхСубконто = Объект.СчетЗатрат.ВидыСубконто.Количество();

	Для Сч = 1 По ЧислоАктивныхСубконто Цикл
		Если Объект.СчетЗатрат.ВидыСубконто[Сч-1].ВидСубконто = ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.СтатьиЗатрат Тогда
			Объект["Субконто" + Сч] = ТаблицаДляСчетов[0].СтатьяЗатрат; //Было Объект.Материалы[0] // 1СTeam Томилин А.П. 05.10.2023 [T1C-3133]
		ИначеЕсли Объект.СчетЗатрат.ВидыСубконто[Сч-1].ВидСубконто = ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.НоменклатурныеГруппы Тогда
			Объект["Субконто" + Сч] = ТаблицаДляСчетов[0].НоменклатурнаяГруппа; //Было Объект.Материалы[0] // 1СTeam Томилин А.П. 05.10.2023 [T1C-3133]
		ИначеЕсли Объект.СчетЗатрат.ВидыСубконто[Сч-1].ВидСубконто = ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.ОбособленныеПодразделения Тогда
			Объект["Субконто" + Сч] = Объект.ПодразделениеОрганизации;
		ИначеЕсли Объект.СчетЗатрат.ВидыСубконто[Сч-1].ВидСубконто = ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.Номенклатура Тогда
			Объект["Субконто" + Сч] = ПараметрыОбъекта["НоменклатураГотовойПродукции"]; 			
		КонецЕсли;
	КонецЦикла;  

КонецЕсли;

Для каждого СтрокаТабличнойЧасти Из Объект.МатериалыЗаказчика Цикл
	СчетаУчета = БухгалтерскийУчет.ПолучитьСчетаУчетаНоменклатуры(Объект.Организация, СтрокаТабличнойЧасти.Номенклатура, Объект.Склад);	
	СтрокаТабличнойЧасти.Счет = СчетаУчета.СчетУчетаДавСырья;
	СтрокаТабличнойЧасти.СчетПередачи = СчетаУчета.СчетПередачиЗаб;
КонецЦикла;


Выполнить(Алгоритмы.ПровестиДокумент);
Выполнить(Алгоритмы.УдалитьСвязанныйДокументТН); //Поменяли местами, было перед Проведением // 1СTeam Томилин А.П. 11.04.2023 [T1C-2934]