Параметры.АвтоЗачетОплаты = ЗначениеЗаполнено(Параметры.СобственныеКонтрагенты.Найти(Источник.Контрагент,"Контрагент"));

Если Источник.ВидОперации = Перечисления.ВидыОперацийПоступлениеТоваровУслуг.ОтветственноеХранение Тогда
	Отказ = Истина;
КонецЕсли;

Если Источник.Комментарий = "Сформировано обработкой переноса остатков" Тогда
	// документы, сформированнные для заведения остатков
Иначе
	Выполнить(Алгоритмы.МожноВыгружатьДокумент);
КонецЕсли;

Если Найти(Источник.Комментарий, "Загружено из MSSQL") > 0 или Найти(Источник.Комментарий, "(не выгружать в БП)") > 0 Тогда
	Отказ = Истина;
КонецЕсли;

Если Не Отказ и Источник.ВидОперации = Перечисления.ВидыОперацийПоступлениеТоваровУслуг.ПоступлениеИзПереработки Тогда
	
	// -- создаем документ "Поступление из переработки" --
	Отказ = Истина;
	//ВыгрузитьПоПравилу(Источник, , Новый Структура("МожноВыгружать", Истина), , "ПоступлениеИзПереработки");
	
КонецЕсли;