// -- обработка ТЧ Продукция --
Объект.Продукция.Очистить();

Объект.СчетЗатрат = ПланыСчетов.Хозрасчетный.ОсновноеПроизводство;

новСтрока = Объект.Продукция.Добавить();
новСтрока.Номенклатура = ПараметрыОбъекта["Номенклатура"];
новСтрока.Количество = ПараметрыОбъекта["Количество"];
новСтрока.ПлановаяСтоимость = 1;
новСтрока.СуммаПлановая = новСтрока.Количество * новСтрока.ПлановаяСтоимость;

ОбработкаТабличныхЧастей.ПриИзмененииНоменклатурыТабЧасти(новСтрока, ЭтотОбъект);
новСтрока.ЕдиницаИзмерения = новСтрока.Номенклатура.БазоваяЕдиницаИзмерения;
новСтрока.Коэффициент      = 1;
новСтрока.Спецификация     = УправлениеПроизводством.ОпределитьСпецификациюПоУмолчанию(новСтрока.Номенклатура, Объект.Дата);
//Объект.ЗаполнитьСчетаУчетаВСтрокеТабЧасти(новСтрока, "Продукция", Истина);
новСтрока.Счет		= ПланыСчетов.Хозрасчетный.ГотоваяПродукция;
новСтрока.НоменклатурнаяГруппа = новСтрока.Номенклатура.НоменклатурнаяГруппа;

// -- обработка ТЧ Комплектующие --
Для каждого СтрокаТЧ из Объект.Материалы Цикл
	СтрокаТЧ.НоменклатурнаяГруппа = Объект.Продукция[0].Номенклатура.НоменклатурнаяГруппа;
	//Объект.ЗаполнитьСчетаУчетаВСтрокеТабЧасти(СтрокаТЧ, "Материалы", Истина);
	СтрокаТЧ.СтатьяЗатрат = Справочники.СтатьиЗатрат.НайтиПоКоду("000000049");
	//Сообщить(СтрокаТЧ.СтатьяЗатрат);
КонецЦикла;

Объект.ДополнительныеСвойства.Вставить("ЗаполнитьСчетаУчетаПередЗаписью", Истина);

Выполнить(Алгоритмы.ПровестиДокумент);