//Если Параметры.ДокументыСОпределениемДопРеквизитов.Количество()  > 0 Тогда
//	
//	Для каждого ДокументСОпределениемДопРеквизитов Из Параметры.ДокументыСОпределениемДопРеквизитов Цикл
//		
//		ТипОбъекта = ТипЗнч(ДокументСОпределениемДопРеквизитов);
//		
//		Если ТипОбъекта = Тип("ДокументСсылка.ПоступлениеДопРасходов") Тогда
//			//переопределение счетов учета
//			ДокументОбъектСОпределениемДопРеквизитов = ДокументСОпределениемДопРеквизитов.ПолучитьОбъект();
//			ДокументОбъектСОпределениемДопРеквизитов.ЗаполнитьСчетаУчетаВТабЧасти(ДокументОбъектСОпределениемДопРеквизитов.Товары, Истина, Истина);
//			
//			Для каждого СтрокаТЧ Из ДокументОбъектСОпределениемДопРеквизитов.Товары Цикл
//				
//				СтрокаТЧ.ОтражениеВУСН = Перечисления.ОтражениеВУСН.Принимаются;
//				
//			КонецЦикла;
//			
//			
//		ИначеЕсли ТипОбъекта = Тип("ДокументСсылка.ГТДИмпорт") Тогда	
//			
//			//переопределение счетов учета
//			ДокументОбъектСОпределениемДопРеквизитов = ДокументСОпределениемДопРеквизитов.ПолучитьОбъект();
//			ДокументОбъектСОпределениемДопРеквизитов.ЗаполнитьСчетаУчетаВТабЧасти(ДокументОбъектСОпределениемДопРеквизитов.Товары, Истина, Истина);
//			
//		КонецЕсли;
//		
//		ЗаписатьОбъектВИБ(ДокументОбъектСОпределениемДопРеквизитов,ТипОбъекта);
//		
//	КонецЦикла;
//	
//КонецЕсли;