СчетаУчета = БухгалтерскийУчетПереопределяемый.ПолучитьСчетаРасчетовСКонтрагентом(Объект.Организация, Объект.Контрагент, Объект.ДоговорКонтрагента);

Объект.СчетУчетаРасчетовСКонтрагентом    = СчетаУчета.СчетРасчетов;
Объект.СчетУчетаРасчетовПоПретензиям     = СчетаУчета.СчетРасчетовПоПретензиям;
Объект.СчетУчетаДоходов                  = СчетаУчета.СчетУчетаДоходовПоТаре;
Объект.СчетУчетаРасходов                 = СчетаУчета.СчетУчетаРасходовПоТаре;
Объект.СчетУчетаРасчетовПоТаре           = СчетаУчета.СчетУчетаТары;
Объект.СтатьяДоходовИРасходов            = Справочники.ПрочиеДоходыИРасходы.РазницыСтоимостиВозвратаИФактическойСтоимостиТоваров;

Выполнить(Алгоритмы.ПровестиДокумент);