Параметры.АвтоЗачетОплаты = ЗначениеЗаполнено(Параметры.СобственныеКонтрагенты.Найти(Источник.Контрагент,"Контрагент"));

//Если НЕ Источник.Организация = Параметры.ОрганизацияВыгрузки Тогда
//	Отказ = Истина;
Если Источник.ВидОперации = Перечисления.ВидыОперацийРеализацияТоваров.РеализацияОтгруженныхТоваров Тогда
	Отказ = Истина;
	// -- такие документы выгружаем по другому --
	ВыгрузитьПоПравилу(Источник, , Новый Структура("МожноВыгружать", Истина), , "РеализацияОтгруженныхТоваров");
ИначеЕсли Найти(Источник.Комментарий, "Загружено из MSSQL") > 0 Тогда
	Отказ = Истина;
	ВыгрузитьПоПравилу(Источник, , Новый Структура("МожноВыгружать", Истина), ,"РеализацияТоваровУслуг");
ИначеЕсли Источник.Комментарий = "Сформировано обработкой переноса остатков" Тогда
	// документы, сформированнные для заведения остатков
ИначеЕсли Источник.ВидОперации = Перечисления.ВидыОперацийРеализацияТоваров.РеализацияУслугПоПереработке Тогда
	ВыгрузитьПоПравилу(Источник, , Новый Структура("МожноВыгружать", Истина), , "РеализацияУслугПоПереработке");	
Иначе	
	Выполнить(Алгоритмы.МожноВыгружатьДокумент);
КонецЕсли;