//склад и организация по умолчанию
Документы.РеализацияТоваровУслуг.ЗаполнитьСчетаУчетаРасчетов(Объект);
Документы.РеализацияТоваровУслуг.ЗаполнитьСчетаУчетаВТабличнойЧасти(Объект, "Товары");
Документы.РеализацияТоваровУслуг.ЗаполнитьСчетаУчетаВТабличнойЧасти(Объект, "ВозвратнаяТара");
Документы.РеализацияТоваровУслуг.ЗаполнитьСчетаУчетаВТабличнойЧасти(Объект, "Услуги");

Если ПараметрыОбъекта <> Неопределено тогда

	ТаблицаПараметровТовары = ПараметрыОбъекта["ТоварыТабличнаяЧасть"];
	
	НомерСтроки = 0;
	Для Каждого СтрокаПараметров Из ТаблицаПараметровТовары Цикл

		ЗначениеПараметра = СтрокаПараметров.Комиссия;
		НоменклатурнаяГруппаПодмены = СтрокаПараметров.НоменклатурнаяГруппаПодмены;
		
		СтрокаТЧ = Объект.Товары.Получить(НомерСтроки);
		//СчетаУчета = БухгалтерскийУчет.ПолучитьСчетаУчетаНоменклатуры(Объект.Организация, СтрокаТЧ.Номенклатура, Объект.Склад);
		
		Если ЗначениеПараметра = Истина Тогда
			СтрокаТЧ.ПереданныеСчетУчета = ПланыСчетов.Хозрасчетный.ТоварыПереданныеНаКомиссию;
			СтрокаТЧ.СчетУчета           = ПланыСчетов.Хозрасчетный.ТоварыНаСкладе;
		КонецЕсли;
		Если ЗначениеЗаполнено(НоменклатурнаяГруппаПодмены) И ТипЗнч(СтрокаТЧ.Субконто) = Тип("СправочникСсылка.НоменклатурныеГруппы")Тогда
			СтрокаТЧ.Субконто = НоменклатурнаяГруппаПодмены;
		КонецЕсли;	
		НомерСтроки = НомерСтроки + 1;

	КонецЦикла;

КонецЕсли; 

//СчетаУчета = БухгалтерскийУчетПереопределяемый.ПолучитьСчетаРасчетовСКонтрагентом(Объект.Организация, Объект.Контрагент, Объект.ДоговорКонтрагента);
//Если Объект.ДоговорКонтрагента.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.СКомиссионером Тогда
//	Объект.СчетУчетаРасчетовСКонтрагентом = ПланыСчетов.Хозрасчетный.ПустаяСсылка();
//	Объект.СчетУчетаРасчетовПоАвансам     = ПланыСчетов.Хозрасчетный.ПустаяСсылка();
//	Объект.СчетУчетаРасчетовПоТаре        = ПланыСчетов.Хозрасчетный.ПустаяСсылка();
//Иначе
//	Объект.СчетУчетаРасчетовСКонтрагентом = СчетаУчета.СчетРасчетовПокупателя;
//	Объект.СчетУчетаРасчетовПоАвансам     = СчетаУчета.СчетАвансовПокупателя;
//	Объект.СчетУчетаРасчетовПоТаре        = СчетаУчета.СчетУчетаТарыПокупателя;
//КонецЕсли;
//Объект.СчетУчетаРасчетовПоТаре        = СчетаУчета.СчетУчетаТарыПокупателя;
//Объект.СчетУчетаРасходовПоТаре      = СчетаУчета.СчетУчетаРасходовПоТаре;
//Объект.СчетУчетаДоходовПоТаре       = СчетаУчета.СчетУчетаДоходовПоТаре;


НомГруппаКассовыеАпп = Справочники.НоменклатурныеГруппы.НайтиПоНаименованию("Кассовые аппараты");
Для Каждого текСтрока из Объект.Товары Цикл  	
	Если текСтрока.СчетДоходов = ПланыСчетов.Хозрасчетный.ПрочиеДоходы Тогда
		текСтрока.Субконто = Справочники.ПрочиеДоходыИРасходы.НайтиПоКоду("000000169"); 		
	ИначеЕсли Объект.Организация.Префикс = "ЦТ" И текСтрока.Субконто.Наименование = "Собственное оборудование" Тогда
		текСтрока.Субконто = НомГруппаКассовыеАпп;	
	КонецЕсли;  	   	
КонецЦикла;

Для Каждого СтрокаТЧ из Объект.СоставНабора Цикл  	
	СчетаУчета     = БухгалтерскийУчетПереопределяемый.ПолучитьСчетаУчетаНоменклатуры(Объект.Организация, СтрокаТЧ.Номенклатура, Объект.Склад);
	СтрокаТЧ.СчетУчета = СчетаУчета.СчетУчета;
	СтрокаТЧ.НоменклатурнаяГруппа = СтрокаТЧ.Номенклатура.НоменклатурнаяГруппа;
КонецЦикла;

Если Объект.ВидОперации = Перечисления.ВидыОперацийРеализацияТоваров.ОтгрузкаБезПереходаПраваСобственности Тогда
	Для Каждого текСтрока из Объект.Товары Цикл
		текСтрока.ПереданныеСчетУчета = ПланыСчетов.Хозрасчетный.ПокупныеТоварыОтгруженные; 		
	КонецЦикла;	
КонецЕсли;

Выполнить(Алгоритмы.ПровестиДокумент);