Если НЕ ЗначениеЗаполнено(Объект.Организация) Тогда
	Объект.Организация = Параметры.ОсновнаяОрганизация;
КонецЕсли;

Для каждого СтрокаТЧ из Объект.Товары Цикл  
	Объект.ЗаполнитьСчетаУчетаВСтрокеТабЧастиРегл(СтрокаТЧ, "Товары", Истина, Истина); 	
КонецЦикла;

Для каждого СтрокаТЧ Из Объект.ВозвратнаяТара Цикл
	Объект.ЗаполнитьСчетаУчетаВСтрокеТабЧастиРегл(СтрокаТЧ, "ВозвратнаяТара", Истина, Истина);
КонецЦикла;

СчетаУчета = БухгалтерскийУчетПереопределяемый.ПолучитьСчетаРасчетовСКонтрагентом(Объект.Организация, Объект.Контрагент, Объект.ДоговорКонтрагента);

Объект.СчетУчетаРасчетовСКонтрагентом    = СчетаУчета.СчетРасчетов;
Объект.СчетУчетаРасчетовПоАвансам        = СчетаУчета.СчетАвансов;
Объект.СчетУчетаРасчетовПоТаре           = СчетаУчета.СчетУчетаТары;

Если НЕ ЗначениеЗаполнено(Объект.Склад) Тогда
	Объект.Склад = Параметры.СкладДляОбменаДаннымиСУТ;
КонецЕсли;

Для каждого СтрокаТЧ Из Объект.Товары Цикл
	СтрокаТЧ.ОтражениеВУСН = Перечисления.ОтражениеВУСН.Принимаются;
КонецЦикла;

Выполнить(Алгоритмы.ПровестиДокумент);