СтрокиКУдалению = Новый Массив();
КоллекцияОбъектов = Источник.Товары.Выгрузить();
Для каждого СтрокаТовары Из КоллекцияОбъектов Цикл
	Если СтрокаТовары.Номенклатура.ВидНоменклатуры.Наименование = "Набор" Тогда
		СтрокиКУдалению.Добавить(СтрокаТовары);
	КонецЕсли;	
КонецЦикла;

Для каждого СтрокаСоставНабора из Источник.СоставНабора Цикл
	// 1СTeam Томилин А.П. 15.01.2026 [T1C-4728] НАЧАЛО
	//СтрокаТовара = КоллекцияОбъектов.Найти(СтрокаСоставНабора.КлючСтроки, "НомерСтроки");
	СтрокаТовара = КоллекцияОбъектов.Найти(СтрокаСоставНабора.КлючСтроки, "КлючСтроки");
	// 1СTeam Томилин А.П. 15.01.2026 [T1C-4728] КОНЕЦ
	Если ЗначениеЗаполнено(СтрокаТовара) Тогда
		НоваяСтрока = КоллекцияОбъектов.Добавить();
	    ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТовара);
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаСоставНабора);
		НоваяСтрока.Количество = НоваяСтрока.Количество * СтрокаТовара.Количество;
		НоваяСтрока.Коэффициент = 1;
	КонецЕсли;
КонецЦикла;

Для каждого СтрокаТовары из СтрокиКУдалению Цикл
	КоллекцияОбъектов.Удалить(СтрокаТовары);
КонецЦикла;