//С требованиями суть такая. Не важно что указано в складе БУ и в организации склада. Нужно попытаться найти кто обслуживает модель оборудования по данномй площадке т.е. подрядчика
//Если подрядчика нет то выгружаем по основным правилам

ВремЗначение = Источник.Склад;

МассивСкладыПодмены = Новый Массив;
Если Источник.Материалы.Количество()>0 И ЗначениеЗаполнено(Источник.Материалы[0].МодельОборудования) Тогда
	МассивСкладыПодмены = Параметры.СкладыПодмены.НайтиСтроки(Новый Структура("Склад, Площадка, ТипОборудования", ВремЗначение, Источник.КлаймДескПлощадка, Источник.Материалы[0].МодельОборудования.ТипОборудования));
КонецЕсли;

Если МассивСкладыПодмены.Количество()>0 Тогда
	Значение = МассивСкладыПодмены[0].СкладПодмены;
Иначе	
	Если Источник.Материалы.Количество()>0 И ЗначениеЗаполнено(Источник.Материалы[0].МодельОборудования) Тогда
		
		//Проверка есть ли подрядчик.
		Запросы.ОрганизацияСкладаПоМоделиОборудования.УстановитьПараметр("КонецПериода", КонецДня(Источник.Дата));
		Запросы.ОрганизацияСкладаПоМоделиОборудования.УстановитьПараметр("ТипОборудования", Источник.Материалы[0].МодельОборудования.ТипОборудования);
		Запросы.ОрганизацияСкладаПоМоделиОборудования.УстановитьПараметр("Площадка", Источник.КлаймДескПлощадка);
		Запросы.ОрганизацияСкладаПоМоделиОборудования.УстановитьПараметр("ВидСвязи", Перечисления.ВидыСобственныхКонтрагентов.Организация);
		Запросы.ОрганизацияСкладаПоМоделиОборудования.УстановитьПараметр("КодОрганизации", Параметры.ОрганизацияВыгрузки.Код);

		Результат = Запросы.ОрганизацияСкладаПоМоделиОборудования.Выполнить().Выгрузить(); 					
		
		Если (Результат.Количество() = 1 И НЕ Результат[0].Объект = Параметры.ОрганизацияВыгрузки) Тогда
			СрезСкладовПодмены = РегистрыСведений.ПодменыПриОбмене.СрезПоследних(Источник.Дата, Новый Структура("ОрганизацияВыгрузки, ДополнительныйРезвизит", Параметры.ОрганизацияВыгрузки, Результат[0].Объект));
			Значение = ?(СрезСкладовПодмены.Количество() > 0, СрезСкладовПодмены[0].Подмена, ВремЗначение);
		ИначеЕсли Результат.Количество() > 1 Тогда
			ИзменитьСклад = Истина;
			
			Запросы.ДоговорПодрядчика.УстановитьПараметр("Владелец", Источник.КлаймДескКонтрагент);
			Запросы.ДоговорПодрядчика.УстановитьПараметр("ВидВзаиморасчетов", Справочники.ВидыВзаиморасчетов.НайтиПоНаименованию("Услуги сервиса"));
			Запросы.ДоговорПодрядчика.УстановитьПараметр("СрокДействия", Источник.Дата);
			Запросы.ДоговорПодрядчика.УстановитьПараметр("Подпись", Перечисления.ксПодписьДокумента.НеПодписан);
			ТаблицаРезультата = Запросы.ДоговорПодрядчика.Выполнить().Выгрузить();
			
			Для Каждого ТекСтрока Из Результат Цикл
				Для Каждого ТекСтрокаПодрядчиков Из ТаблицаРезультата Цикл
					Если (ТекСтрокаПодрядчиков.Организация <> Параметры.ОрганизацияВыгрузки) И (ТекСтрокаПодрядчиков.Организация = ТекСтрока.Объект) Тогда
						СрезСкладовПодмены = РегистрыСведений.ПодменыПриОбмене.СрезПоследних(Источник.Дата, Новый Структура("ОрганизацияВыгрузки, ДополнительныйРезвизит", Параметры.ОрганизацияВыгрузки, ТекСтрокаПодрядчиков.Организация));
						Значение = ?(СрезСкладовПодмены.Количество() > 0, СрезСкладовПодмены[0].Подмена, ВремЗначение);
						ИзменитьСклад = Ложь;
						Прервать;
					КонецЕсли;
				КонецЦикла;
				Если НЕ ИзменитьСклад Тогда
					Прервать;
				КонецЕсли;
			КонецЦикла;
			Если ИзменитьСклад Тогда
				мСклад = ВремЗначение;
				Выполнить(Алгоритмы.ОпределитьСкладВыгрузки);
			КонецЕсли;
		Иначе
			//Если нету подрядчика то проверяем склад.
			мСклад = ВремЗначение;
			Выполнить(Алгоритмы.ОпределитьСкладВыгрузки);
		КонецЕсли;
	Иначе
		мСклад = ВремЗначение;
		Выполнить(Алгоритмы.ОпределитьСкладВыгрузки);
	КонецЕсли;
	
	Если Источник.Материалы.Количество()>0 Тогда
		НоваяСтрока = Параметры.СкладыПодмены.Добавить();
		НоваяСтрока.Склад = Источник.Склад;
		НоваяСтрока.Площадка = Источник.КлаймДескПлощадка;
		НоваяСтрока.ТипОборудования = Источник.Материалы[0].МодельОборудования.ТипОборудования;
		НоваяСтрока.СкладПодмены = ?(Значение = Неопределено, ВремЗначение, Значение);
	КонецЕсли;	
КонецЕсли;