//СвойствоСтраховойНомерПФР = ПланыВидовХарактеристик.СвойстваОбъектов.НайтиПоНаименованию("СтраховойНомерПФР");
//ЗапросДоп = Новый Запрос("ВЫБРАТЬ
//							 |	ЗначенияСвойствОбъектов.Объект,
//							 |	ЗначенияСвойствОбъектов.Значение
//							 |ИЗ
//							 |	РегистрСведений.ЗначенияСвойствОбъектов КАК ЗначенияСвойствОбъектов
//							 |ГДЕ
//							 |	ЗначенияСвойствОбъектов.Свойство = &Свойство
//							 |	И ЗначенияСвойствОбъектов.Объект = &Объект");
//ЗапросДоп.УстановитьПараметр("Свойство", СвойствоСтраховойНомерПФР);
//ЗапросДоп.УстановитьПараметр("Объект", Источник);	
//РезультатДоп = ЗапросДоп.Выполнить().Выгрузить();
//Значение = ?(РезультатДоп.Количество() = 0 , "", РезультатДоп[0].Значение);