Если Источник.ВидОперации = Перечисления.ВидыОперацийПоступлениеБезналичныхДенежныхСредств.РасчетыПоКредитамИЗаймам Тогда
	
	Если Источник.Контрагент.ЮрФизЛицо = Перечисления.ЮрФизЛицо.ФизЛицо И Источник.Контрагент.Родитель.Код = "000003337"  Тогда //группа сотрудники
		КоллекцияОбъектов =  Источник.РасшифровкаПлатежа.ВыгрузитьКолонки(); 	
	КонецЕсли;
	
Иначе
	
	ТипДокументаРасчетов = "ПоступлениеНаРасчетныйСчет";
	КоллекцияОбъектов = Источник.РасшифровкаПлатежа.Выгрузить();
	Выполнить(Алгоритмы.ОчиститьНекорректныеТипыДокументовРачетов);
	
КонецЕсли;