Если НЕ ЗначениеЗаполнено(Объект.Организация) Тогда
	Объект.Организация = Параметры.ОсновнаяОрганизация;
КонецЕсли;

СчетаУчета = БухгалтерскийУчетПереопределяемый.ПолучитьСчетаРасчетовСКонтрагентом(Объект.Организация, Объект.Контрагент, Объект.ДоговорКонтрагента);
Объект.СчетУчетаРасчетовСКонтрагентомВал = СчетаУчета.СчетРасчетов;

СчетаУчета = БухгалтерскийУчетПереопределяемый.ПолучитьСчетаРасчетовСКонтрагентом(Объект.Организация, Объект.Контрагент, Объект.ДоговорКонтрагентаРегл);
Объект.СчетУчетаРасчетовСКонтрагентом = СчетаУчета.СчетРасчетов;

//Для Каждого СтрокаТЧ Из Объект.Товары Цикл
//	Объект.ЗаполнитьСчетаУчетаВСтрокеТабЧасти(СтрокаТЧ, Истина, Истина);
//КонецЦикла;

//Если Объект.ЭтоНовый() Тогда
//	
//	Параметры.ДокументыСОпределениемДопРеквизитов.Добавить(Объект.ПолучитьСсылкуНового());
//	
//Иначе
//					
//	Параметры.ДокументыСОпределениемДопРеквизитов.Добавить(Объект.Ссылка);
//	
//КонецЕсли;

Документы.ГТДИмпорт.ЗаполнитьСчетаУчетаВТабличнойЧасти(Объект, "Товары");

Выполнить(Алгоритмы.ПровестиДокумент);