Если Не Источник.Проведен или Не Источник.Организация = Параметры.ОрганизацияВыгрузки Тогда
	Отказ = Истина;
КонецЕсли;
Если Источник.ДокументыОснования.Количество() = 1 
	И ТипЗнч(Источник.ДокументыОснования[0].ДокументОснование)=Тип("ДокументСсылка.ОплатаОтПокупателяПлатежнойКартой") тогда
	Отказ = Истина;
КонецЕсли;
// 1СTeam Томилин А.П. 29.12.2025 [T1C-4732] НАЧАЛО
Если Не Отказ И (Источник.ВидСчетаФактуры = Перечисления.ВидСчетаФактурыВыставленного.наАванс 
	 	Или Источник.ВидСчетаФактуры = Перечисления.ВидСчетаФактурыВыставленного.НаАвансКомитента) 
	 И Источник.Дата < Дата(2025,12,1) Тогда
	Отказ = Истина;
КонецЕсли;
// 1СTeam Томилин А.П. 29.12.2025 [T1C-4732] КОНЕЦ
