//Если Объект.ДокументОснование <> Неопределено Тогда
//	Объект.ЗаполнитьДатуИНомерВходящегоДокумента(); 	
//КонецЕсли;

// 1СTeam Томилин А.П. 29.12.2025 [T1C-4732] НАЧАЛО
Если (Объект.ВидСчетаФактуры = Перечисления.ВидСчетаФактурыВыставленного.наАванс 
		 Или Объект.ВидСчетаФактуры = Перечисления.ВидСчетаФактурыВыставленного.НаАвансКомитента)
	 И Объект.ДокументыОснования.Количество() > 0 Тогда
	Объект.ДокументОснование = Объект.ДокументыОснования[0].ДокументОснование;
	Если Не ЗначениеЗаполнено(Объект.СтавкаНДС) И Объект.Авансы.Количество() > 0 Тогда
		Объект.СтавкаНДС = Объект.Авансы[0].СтавкаНДС;
	КонецЕсли;
КонецЕсли;
// 1СTeam Томилин А.П. 29.12.2025 [T1C-4732] КОНЕЦ

Выполнить(Алгоритмы.ПровестиДокумент);